#include<stdio.h>

typedef struct employee {
	int number;
	char name[20];
	char phone[15];
	int age;
}EMPLOYEE;

int main() {
	EMPLOYEE a[10] = { 
		{1, "È«±æµ¿1", "01012345678", 20}, 
	{2, "È«±æµ¿2", "01087654321", 22},
	{3, "È«±æµ¿3", "01023456789", 24},
	{4, "È«±æµ¿4", "01098765432", 26},
	{5, "È«±æµ¿5", "01014725836", 28},
	{6, "È«±æµ¿6", "01063852741", 30},
	{7, "È«±æµ¿7", "01047258369", 32},
	{8, "È«±æµ¿8", "01096385274", 34},
	{9, "È«±æµ¿9", "01095175397", 36},
	{10, "È«±æµ¿10", "01035715913", 38} };

	for (int i = 0;  i < 10; i++) {
		if (a[i].age <= 30 && a[i].age>=20)
			printf("»ç¹ø : %2d     ÀÌ¸§ : %s     ÀüÈ­¹øÈ£ : %s     ³ªÀÌ : %d\n", a[i].number, a[i].name, a[i].phone, a[i].age);
	}
	return 0;
}